start='''ربات دارک اتکر اماده ی ارائه خدمات ( ارسال کردن بنر ، اسپم ، سین ، تبچی ) و ده ها قابلیت دیگر به شما هست 🌒⚜️

🔅 از دکمه های زیر میتوانید خدمات مورد نظر خود را انتخاب کنید 🔅'''

Hello_Sear='''سلام مدیر 💎
🔧 از منوی زیر میتونید ربات را کنترل کنید 🔧'''

Coin_Lack='موجودی حساب شما برای انجام عملیات کافی نیست !'

Buy_Coin='کاربر گرامی برای تهیه کوین میتوانید و مراجعه به پشتیبانی روی دکمه ی زیر کلیک کنید ! '

Coin_Details=lambda coin , name , date: f'''اطلاعات حساب 👤 :
نام : {name} 🤌🏽
سکه : {coin} 🪙
اشتراک روزانه : {date} 📅
'''
Support = '🔰 پاسخ دهی به سریع ترین حالت ممکن در حال انجام است و لطفا صبور باشید ! \n برای ورود به پیوی روی دکمه ی زیر کلیک کنید 🧑🏼‍💻'


Attack_Pannel='وارد پنل اتک شدید ⚠️ !'

Attack_Main_Pannel='''🔆 به پنل اصلی تبلیغات وارد شدید 🔆
تخریبی💥💥💥 یا بدون فلاد 💥 :
در این نوع اتک با استفاده از الگوریتم های پیشرفته وقتی اکانتی از طرف تلگرام محدود میشود ، به لیست انتظار اضافه میشود تا زمانی که محدودیتش تمام شود و  زمانی که محدودیت اکانت تمام شد ، اکانت به فرایند تبلیغات باز میگردد و اگر زمان محدودیت بیشتر از زمان اتک باشد ، اکانت وارد فرایند نمیشود 🔥

هوشمند🧠:
در این نوع اتک ربات به صورت هوشمندانه زمان محدود شدن را میسنجد و طبق الگوریتم تبلیغات را متوقف میکند تا محدودیت اکانت تمام شود یا اکانت را از فرایند حذف میکند 🔥

تبلیغاتی👀:
این نوع اتک برای تبلیغات مناسب هست و طبق الگوریتم به هر یوزرنیم فقط یک بنر ارسال میشود 🔥'''

Banner_Pannel= 'وارد پنل بنر ها شدید 📩 !'

Main_Pannel='وارد پنل اصلی شدید !⚜️'

Add_Benner='بنر مورد نظر خود را ارسال کنید , همچنین میتوانید از قسمت ** بنر های فعلی📩 ** بنر خود را پاک کنید ! '

Banner_Added='بنر فرستاده شده به لیست بنر ها اضافه شد ✅'

Banner_Removed='بنر با موفقیت حذف شد ✅ '

No_Banner_Setted='''⭕️ کاربر گرامی :
لطفا اول بنر خود را ثبت کنید .'''

Account_Pannel='وارد پنل اکانت ها شدید !👤'

Seen_Pannel='وارد پنل سین و لایک شدید 👁️'

Add_Account='لطفا شماره اکانت خود را با پیش شماره و + ارسال کنید 🛑'

Number_Is_Regestered='📛 شماره ی فرستاده شده قبلا در ربات ثبت شده است ، برای پاک کردن و اثبات مالکیت شماره به پشتیبانی مراجعه فرمایید 📛'

Problem_Occured='مشکلی در ارتباط با سرور تلگرام پیش امد 🌐🚦'

Problem_with=lambda num , e : f'🚦 مشکلی با اکانت {num} در انجام عملیات پیش امد . \n {e}'

Left_after_task = ' آیا ربات بعد از عملیات از گروه با اکانت ها لفت بدهد ؟ \n `بله` \n `خیر`'

Send_Code='''کاربر گرامی : کد ارسال شده به اکانت را به صورت اعداد انگلیسی بفرستید ! 
⚠️ نکته : اگر اکانت دارای رمز است رمز را نیز به شکل مثال زیر در کنار کد بنویسید !
مثال : 
Code Password
856911 amir '''

Send_Code_Again='''🛑کاربر گرامی : کد ارسال شده به اکانت را ** دوباره ** به صورت اعداد انگلیسی بفرستید ! 
** فقط کد را بفرستید ** نیازی به فرستادن رمز نیست !🛑 '''


Send_Code_Error=lambda Code:f'''کد را به صورت عدد و با توجه به توضیحات بالا بفرستید !! 
 کد اشتباه فرستاده شده : {Code} ❌'''

succesfully_loggin='ربات با موفقیت وارد اکانت شد !✅'

Number_Incorrect='شماره ارسال شده اشتباه است ‼️'

Flood_Wait_Loggin=lambda X:f'اکانت شما به مدت {X} محدود است !🚒'

Password_Incorect=lambda hint:f'''رمز اکانت اشتباه است ⚠️ لطفا دوباره پسورد را به صورت تنها وارد کنید :
راهنما : {hint} '''

Password_requerd='رمز اکانت را وارد نکردید , اکانت رمز دارد ❌'

Time_Out='''🔅 فرصت شما برای فرستادن مقدار درخواست شده تمام شد 🕒
لطفا دوباره فرایند مورد نظر را از اول شروع کنید  ! 🔅'''

Password_Is_Incorect='⚠️رمز اکانت را 2 بار اشتباه وارد کردید !! \n دوباره فرایند را از اول طی کنید !'

Runned_WO_API=lambda num , name , id :f'''اکانت شما با شماره ب {num} با موفقیت ثبت شد ✅

🔹Name : {name}
🔸Id : {id}

خطر ⚠️ : اکانت شما با api ثابت خود ربات ثبت شد و ربات قادر به دریافت api خود‌ اکانت نبود'''

Runned_W_API =lambda num , api , id ,name,Uid: f'''کاربر گرامی شماره ی شما با Api خودکار روی ربات ران شد 🔥
🔹Name : {name}
🔸Id : {Uid}
🔹Number :
` {num} `
🔸API : 
` {api} `
🔹API ID : 
` {id} ` '''

Cancel_btn='❌ انصراف ❌'

Cancel='عملیات بعد از چند ثانیه کنسل خواهد شد  ✅'

Accounts_list='''📜 لیست اکانت های شما : 
🟢 : فعال
🔴 : غیرفعال 
'''
Accounts_Status='''🗂️وضعیت اکانت های شما 🗂️
🟩 : سالم
🟨 : ریپورت موقت
🟥 : ریپورت دائم
❌ : دیلیت شده 
🚫 : ربات از اکانت بیرون افتاده شده 
'''

Deleting_Numbers='به قسمت حذف شماره ها وارد شدید 🗑🗞 '

All_Deleted='تمام اکانت ها با موفقیت حذف شدند  🗑️ !'

Account_Deleting='''🗑 برای پاک کردن چند یا یک اکانت اکانت هارا در یک پیام و هر اکانت ها در یک خط بفرستید .
مثال :

+98294924637
+98039268382
+98876558283'''

Selected_Numbers_Deleted = 'شماره های انتخاب شده پاک شدند 🗑️ !'

Limited_Numbers_Deleted = 'شماره های ریپورت شده پاک شدند 🗑️ !'

StartBot_Times='تعداد بار هایی که میخواهید ربات استارت شود را به عدد اینگلیسی بفرستید !'

StartBot_User=''' 🔅 کاربر گرامی : 
ایدیه بات مورد نظر را با @ بفرستید !'''

Refferal='''🔅 اگر رفرال یا زیر مجموعه گیری دارد لطفا لینک رفرال را بفرستید در غیر این صورت عبارت ```None``` را بفرستید !🔅

مثال :
https://t.me/Nestarcadeairdrop_bot?start=r05422361214'''

StartBot_Completed=lambda Time:f' تعداد {Time} اکانت ربات را با موفقیت استارت زدند ✅'

Leave=lambda T , F : f'''⚒ عملیات تمام شد ⚒
تعداد اکانت هایی که با موفقیت لفت دادند : {T}
تعداد اکانت هایی که با مشکل بر خوردند : {F}'''

Join=lambda T , F : f'''⚒ عملیات تمام شد ⚒
تعداد اکانت هایی که با موفقیت جوین شدند : {T}
تعداد اکانت هایی که با مشکل بر خوردند : {F}'''

Leave_Chat_Ask='ایدی عددی یا یوزر نیم یا لینک گروه مورد نظر خود را ارسال کنید :'

JoinChat_Ask='لینک گروه یا کانال مورد نظر را ارسال کنید :'

Number_Ask='شماره مورد نظر را برای دریافت کد ها ارسال کنید !'

Not_Owner='❌❌ شما صاحب این شماره نیستید ❌❌'

Recived_Code=lambda cd:f'''کد های دریافت شده 🗳 : 
{cd}'''

Clearing='''♻️ کاربر گرامی :
برای پاکسازی اکانت ها :
اکانت های مورد نظر را در یک پیام به صورت لیستی بفرستید و یا عبارت ` همه ` را ارسال کنید !♻️'''

Clearing_Kind='''♻️ کدام نوع از پاکسازی مورد نظر شما هست ؟ ♻️
🔰 گذینه های مورد نظر را به همراه و برای ربات بفرستید 

- ` کانال `
- ` پیوی ` 
- ` گروه `
- ` ربات `
** مثال :   ** کانال و گروه'''

PV_KIND='پیوی'
CHNL_KIND='کانال'
GROUP_KIND='گروه'
BOT_KIND='ربات'

All_abrvtn='همه'

Clearing_Details=lambda p , c , g , b :f'''فرایند پاکسازی اکانت ها با اطلاعات :
♻️ پاکسازی کانال ها :  {c}
♻️پاکسازی گروه ها :  {g}
♻️ پاکسازی پیوی ها :  {p}
♻️ پاکسازی ربات ها :  {b}
درحال انجام شدن هست ! 
از فشردن دکمه های دیگر اجتناب کنید 📛'''

Clearing_Finished=lambda X:f'''فرایند پاک سازی تمام شد ✅
⭕️ تعداد فرایند های انجام شده : {X}'''

Wrong='''🚫 کاربر گرامی :

فرایند را اشتباه انجام دادید ❌
لطفا دوباره اقدام به انجام نمایید 💢'''

HELP=lambda photo , bio , name , num_len , r_speed , a_speed , bnr_len , usrname: f'''🔥 پنل اکانت دارک اتکر 🔥
شما با استفاده از این پنل میتوانید از صد ها قابلیت دارک اتکر استفاده کنید . 
برای استفاده کافیت اکانت های خود را ثبت کنید و از دکمه ها استفاده کنید ! 

🔰 برای استفاده از فرایند ها برای فقط یک اکانت کافیست شماره ی ان را به صورت تکی بفرستید 🔰

⚙️ تنظیمات شما درحال حاظر ⚙️ 
🏞 عکس خودکار : {photo}
🖋 بیو خودکار : {bio}
📖 نام خودکار : {name}
📬 تعداد اکانت ها : {num_len}
🕘 توقف اتک در‌ چرخش هر اکانت  : {r_speed}
🕒 توقف اتک در چرخش هر یوزرنیم : {a_speed}
🀄️ تعداد بنر : {bnr_len}

در صورت داشتن هر ایده میتوانید به پیوی سازنده ربات مراجعه نمایید : 
🔅🔱 @{usrname} 🔱🔅'''

Account_Setting = ' وارد پنل تنظیمات اکانت ها شدید 🔩 ⚙️'

Ask_Reciver='''کاربر گرامی :
💢 ایدی عددی مقصد ( فرد دریافت کننده ی اکانت ها ) را بفرستید 💢'''

Not_Regestered='کاربر مورد نظر ربات را استارت نکرده است !❌'

Transfered=lambda N , S_n , R_N :f'اکانت های {S_n} با موفقیت به {R_N} انتقال داده شدند !✅ \n اکانت ها : \n {N}'

Ask_Nums='''🔰 کاربر گرامی :
برای فرایند مورد نظر ها :
اکانت های مورد نظر را در یک پیام به صورت لیستی بفرستید و یا عبارت ` همه ` را ارسال کنید  !
و یا عدد شماره ی اکانت را بفرستید 
و یا به صورت ` x:y ` اکانت ها را انتخاب کنید : 🔰
مثال : ` 10:20 `  <<< اکانت های 10 تا 20 انتخاب میشوند !
'''
# و یا میتوانید با ارسال x:y اکانت ها را انتخاب کنید
# مثال : 11:25 
# اکانت 11 تا اکانت 25 تم انتخاب میشوند !'''

Ask_Details_kind='''👾 کدام نوع از تنظیم مشخصات مورد نظر شما هست ؟ 👾
🔰 گذینه های مورد نظر را به همراه و برای ربات بفرستید 

- ` پروفایل `
- ` اسم ` 
- ` بیو `
** مثال :   ** پروفایل'''

Pro_Text = 'پروفایل'
Bio_Text = 'بیو'
Name_Text = 'اسم'

Replaced_abbr='` {n} `'
Get_Details=lambda D : f'''لطفا {D} مورد نظر که میخواهید روی اکانت ها ست شود را بفرستید 🔱

⚠️ نکته : 
با استفاده از{Replaced_abbr}میتوانید عدد اکانت را به اسم اضافه کنید. 
مثال :
amirali ➙ amir¹ali'''

Detailes_Finished=lambda T , F :f'''📝 فرایند تنظیم مشخصات تمام شد 📝 :
فرایند های موفقیت امیز : {T}
فرایند هایی که به مشکل بر خوردند : {F} '''

Change_Activity='🔅 با کلیک بر روی شماره ی مورد نظر فعالیت اکانت را خاموش یا روشن کنید 🔅'

Auto_Acc_Details='''🔰 با استفاده از دکمه های زیر مشخص کنید تنظیم خودکار چه مواردی را میخواهید بر رویت اکانت های جدید ثبت کنید 

🔅 از این بخش میتوانید تنظیم خودکار مشخصات را بر روی اکانت ها ثبت کنید 🔅'''

Auto_Details_Setted=lambda K : f'''🔱 عملیات با موفقیت انجام شد و تنظیم خودکار {K} با موفقیت انجام شد ✅'''

Number_Is_Deleted=lambda Num: f'💢📛 : اکانت ی {Num} از سرور تلگرام دیلت شده است ! پس از فرایند اتک و از دیتا بیس حذف میگردد 💢'

Number_Is_Terminated=lambda Num: f'⭕️📛 : ربات از دسترسی به اکانت {Num} را ندارد و ربات از اکانت بیرون انداخته شده است  ⭕️'

Ask_Usernames='💢 لیست یوزر نیم ها یا شماره تلفن ها را بفرستید :'

Link_Attack='''🔥 ایا میخواهید بنر مورد نظرتون دکمه شیشه ای با لینک کانال مورد نظرتون داشته باشد ؟ 

⚠️ اخطار :  این روش فقط برای وقتی است که تمام بنر های شما کاملا تکست است و فاقد عکس یا گیف هست 
- لینک کانال را بفرستید 
- یا واژه ی ` خیر ` را ارسال کنید'''

Link_btn_Attack='''⭕️ لطفا متنی که میخواهید روی دکمه شیشه ای حاوی لینک باشد را ارسال کنید ⭕️

⚠️ : متن دکمه نباید بیشتز از 15 حرف باشد !'''

No='خیر'
yes='بله'

Username_NV=lambda Usr:f'⚠️ یوزر نیم نامعتبر است : {Usr}'
Username_Ch=lambda Usr:f'⚠️ یوزر نیم کانال است : {Usr}'

Reported=lambda Num :f' اکانت {Num} ریپورت شده است و به صورت خودکار از فرایند اتک حذف میگردد !'

Attack_Details=lambda Attack , X ,T:f'''📢 : فرایند اتک تمام شد 

{Attack}

🔱 در مجموع تعداد {X} بنر به ایدی ها ارسال شد 
🕚 در مدت زمان {T} ثانیه ! '''

Join_Btn='🔥 JOIN 🔥'

Failed_attack= lambda X , Y : f'''' 📛📛📛📛 اتک تمام نشد 📛📛📛📛
لیست اکانت هایی که اتک نخوردند
اکانت : {Y}

`{X}`

'''


Flood_Attack=lambda num , X : f'''⭕️ اکانت {num} توسط سرورهای تلگرام {X}ثانیه محدود شده است ، ربات به علت کم بودن محدودیت فرایند اتک را تا برطرف شدن محدودیت متوقف میکند ، سپس بعد از اتمام محدودیت فرایند به صورت خودکار از مجددااغاز میشود !

📛 : تا اتمام فرایند دکمه ای را ارسال نکنید !'''

High_Flood_Attack=lambda num : f'⭕️ اکانت {num} به محدودیت سنگینی خورد و از فرایند تبلیغات کنار گذاشته شد ✅'

Ask_Round='''⭕️ کاربر گرامی : 
تعداد بنر هایی که میخواهید به هر یوزرنیم ارسال شود را بفرستید و در صورت تبلیغ با حداکثر توان عبارت ` نامحدود ` را ارسال کنید !'''

Username_Details=lambda  users : f'''🔥 اطلاعات اکانت ها و تعداد بنر های ارسال شده به آن ها 🔥 
{users}'''

Ask_Link='''⭕️کاربر گرامی : 
لینگ گروه هدف را ارسال کنید :'''

User_Limit='''⭕️کاربر گرامی : 
تعداد یوزرنیم های مورد نظر خود که توسط اکانت ها جمع میشوند را ارسال کنید :'''

n="\n"
Username_Catched=lambda X : f'''🔥 یوزر نیم های جمع اوری شده :
تعداد : {len(X.split(n))} 

`{X}` '''

Fake_Detailes_Setted=lambda Accs,X,Y,Z:f'''👤 تعداد {Accs} اکانت هویت سازی شدند :
▪️ تعداد {X} عکس روی اکانت ها قرار گرفت 
▪️ تعداد {Y} نام و بیو روی اکانت ها قرار گرفت
▪️ تعداد {Z} یوزرنیم بر‌روی اکانت ها نیز قرار گرفت ✅

⚠️تذکر: تمام مسئولیت استفاده از این بخش بر عهده کاربر میباشد !'''

Cancel_Proccess='لغو'

Auto_Details_Deleted=lambda Kind:f'⭕️ تنظیم خودکار {Kind} با موفقیت برداشته شد ✅'

Attack_Setting='⚙️ وارد بخش تنظیمات تبلیغ و اسپم شدید ⚙️'

R_Speed_Setting = lambda speed : f'''💡 توقف راند  : 
زمانی که بعد از به پایان رسیدن لیست هدف ها توسط یک اکانت ، اتک متوقف میشود تا فرایند را با اکانتی دیگر شروع کند

🔧 زمان فعلی : {speed}s
⚙️ زمان پیشنهادی : 20s'''

A_Speed_Setting = lambda speed : f'''💡 توقف اتک  : 
زمانی که بعد از هر ایدی اکانت توقف میکند تا به ایدی بعدی بنر بدهد

🔧 زمان فعلی : {speed}
⚙️ زمان پیشنهادی : 2'''
    
Speed_Setted =lambda X : f'⚙️ سرعت اتک بر روی {X} قرار گرفت ⚙️'

Ask_Id='👤 ایدی عددی یا یوزرنیم فرد مورد نظر را ارسال کنید'

Ask_Coin_Amount='🪙 تعداد کوین هایی که میخواهید به حساب فرد واریز شود را ارسال کنید'

Not_Started = '❌ کاربر ربات را استارت نکرده است'

Coin_Tranfered=lambda X : f'''💰 کاربر گرامی 💰
تعداد {X} کوین 🪙 از طرف پشتیبانی به حساب شما واریز شد  ✅🔥'''

Coin_Submitted='سکه ها به موجودی فرد اضافه شدند 🪙'


AskSpam_Banners_num='''💡 تعداد بنر هایی که میخواید در اسپم استفاده کنید را به صورت عدد انگلیسی ارسال کنید :

مثال :  4

⚠️ توجه  : 
سرعت تنظیم شده برای اتک برای اسپم هم نیز استفاده میشود 
سرعت اتک : سرعت بین هر پیام 
سرعت راند : سرعت بین تعویض هر اکانت'''

Proccess_Started='🔅 فرایند شروع شد لطفا از فشردن دکمه های دیگر خودداری فرمایید 🔅'

Spam_Complited=lambda X: f'📛 فرایند اسپم تمام شد و تعداد {X} اسپم صورت گرفت ✅'

Ask_SpamBanner='💡 بنری که میخواهید توی اسپم استفاده شود را بفرستید :'

Ask_Text='متن مورد نظر خود را بفرستید : '

Catcher_Kind='''👤 کاربر گرامی : 
لیست گیری با توجه به ممبر ها یا اکانت هایی که پیام دادند انجام بشود ؟ 

- ` پیام ها `
- ` ممبر ها `

💡 : لیستگیری بر اساس پیام ها کاربران فعال را باز میگرداند !'''

Members='ممبر'
Messages='پیام'

Ask_Speed='''⭕️ کاربر گرامی سرعت مورد نظر خود را بفرستید 
🔅دقت داشته باید سرعت منفی وجود ندارد !'''

Join_Channel=lambda channel : f'''🔥 کاربر گرامی 🔥

برای استفاده از دارک اتکر اول باید در‌ چنل ربات جوین بشید 💎
🔅 - @{channel}'''

AskBlocks='''⭕️ایا میخواهید ربات ها بلاک شوند ؟

-`بله `
-`خیر`'''

Username_Added_Details=lambda Users,X,T:f'''✅عملیات به پایان رسید و درکل {X} یوزر در گروه اد شدند ✅

📛لیست فرایند هایی که به مشکل بر خوردند :

`{Users}`

تایم انجام فرایند : {T}'''

Ask_Adding_Link='⭕️ لطفا لینک گروهی که میخواهید اعضا در ان اد شوند را ارسال کنید :'

Stats=lambda states,X:f'''- تعداد {states[1]} نفر در ربات عضو و تعداد {states[0]} شماره در ربات ثبت شده است🔥
و {X} کوین در ربات وجود دارد !'''

Bests=lambda stats:f'''🔅 برترین اتکر ها بر اساس اکانت های ثبت شده 🔥
{stats}'''

Ask_Emoji='⭕️ ایموجی مورد نظر خود را که میخواهید ری اکت شود را ارسال کنید :'

Ask_P_O_Link='''⭕️ کاربر گرامی :
لطفا لینک پیام مورد نظر را بفرستید : 

مثال : 
https://t.me/DarkBotsChannel/99'''

Ask_Private_Link='''🔭 کانال فرستاده شده توسط ربات پرایوت تشخیص داده شده است ! 

لطفا لینک کانال را بفرستید تا ربات ها در‌ کانال جوین شوند و سپس فرایند اغاز میشود ❕🔅

مثال : 
https://t.me/+ZCUXI1z3EtVkNGRk'''

Invalied_Reaction='''📛 کاربر گرامی:
 ری اکشن فرستاده شده مورد قبول سرور تلگرام نیست ! 
فقط ایموجی هایی که در‌کانال قابل قبول باشد امکان ری اکت دارند ❕'''

Reaction_Compeleted=lambda X , emj : f'''عملیات ری اکشن با موفقیت تمام شد و {X} ری اکشن با ایموجی {emj} صورت گرفت ✅'''

Procces_Compeleted=lambda X : f'فرایند با موفقیت تمام شد و {X} فرایند توسط ربات انجام شد ✅'
Procces_Compeleted_WO_NO= ' فرایند توسط ربات انجام شد ✅'

User_Details=lambda username , name , mention , id : f'''کاربر {mention} : 
اسم : {name} 
ایدی عددی : {id}
یوزرنیم : {username} '''

AddRestricted=lambda User: f'اد کاربر {User} بسته است !'

My_Rank=lambda rank :f'''رتبه ی شما در بین همه ی اتکر ها : {rank}'''

Active_Procceses=lambda X : f'''افراد فعال 🔆 : 
{X}'''

Active_Procceses_Len=lambda X :f'تعداد افراد فعال : {X}'

Ask_Channel='''⭕️ کاربر گرامی :
لطفا یوزرنیم کانال/فرد/گروه مورد نظر را بفرستید : '''

Ask_Reason='''کاربر گرامی نوع ریپورت خود را مشخض کنید : 

` ChildAbuse `

` Copyright `

` Fake `

` GeoIrrelevant `

` IllegalDrugs `

` Other `

` PersonalDetails `

` Pornography `

` Spam `

` Violence `


از کلمات بالا نوع ریپورت را انتخاب کنید و بفرستید !
'''


report=lambda name : f'This contant should delete from telegram this report is sent by {name} me !'

Reported_by=lambda X : f'مسیج مورد نظر توسط {X} اکانت با موفقیت ریپورت شد ✅ '

Spam_Count='تعداد پیام هایی که میخواهید از هر اکانت اسپم بشود را ارسال کنید :'


ask_RMessage='''⭕️ کاربر گرامی :
لطفا دلیل ریپورت و گذارش این پیام را به صورت مختصر در 2 خط بنویسید⭕️  '''

AskDeleted_Account='لطفا ایدی اکانتی که دیلیت شده است را ارسال کنید : '

Account_Tranferred= lambda x , user , new_user  : f''' ⭕️✅ تمامی اطلاعات شامل (کوین و اکانت ها) از اکانت دیلیت شده به اکانت جدید ارسال شدند ! 
s
👤 ایدی عددی اکانت قبلی : {user} 
👤 ایدی عددی اکانت جدید : {new_user} 

💡 اکانت های ارسال شده : 💡

{x}

'''

Terminated = lambda nums , x : f'''⭕️✅ فرایند تمام شد ⭕️✅
💡 تعداد اکانت هایی که سشن هایشان ترمینیت شدند : {x} 
💡 شماره ها 💡 
{nums}'''

Membership_Added=lambda X : f'''⭕️ کاربر گرامی :
💡 اشتراک روزانه برای شما تا تاریخ : 
` {X} ` فعال شد ! 💡
'''

Membership_Submitted='اشتراک با موفقیت برای کاربر واریز شد ✅ '

Ask_Date='⭕️ ادمین گرامی : لطفا تعداد روز های اشتراک را ارسال کنید : '


Ask_NewPass='''⭕️ کاربر گرامی :
لطفا رمزی که میخواهید روی اکانت ها قرار بگیرد را ارسال کنید ! '''


Ask_Common_Pass='''⭕️ کاربر گرامی :
اگر اکانت ها رمز دارند لطفا رمزی که استفاده کردید را ارسال کنید : 
💡 : در صورت اشتباه بودن رمز دوباره از شما سوال میشود !
'''


AskPass_Invalied=lambda num : f'''📛 مشکل در تغییر رمز دوم : 
رمز اکانت {num} اشتباه بود 

💡: لطفا رمز درست را ارسال نمایید ! 
📛 برای کنسل کردن فرایند  واژه ی `لغو` را بفرستید 
'''

PassWord_Invalied_Skiped='پسورد اکانت اشتباه بود و ربات ان را از فرایند حذف میکند !'


Password_Adding_Finished=lambda X , P : f'''عملیات تنظیم پسورد با موفقیت تمام شد ✅

💡 فرایند های موفق : {X}
💡رمز جدید : ` {P} `

Tag : #password
'''

Catcher_type='''⭕️ فیلتر هایی که میخواهید را انتخاب کنید و سپس در پیام بعدی ارسال کنید : 
`ONLINE`    -   انلاین ها 
`RECENTLY`  -    لست سین ریسنتلی ها
`PHOTO`     -  عکس دار ها
`ADMINS`    -  ادمین ها 
`MEMBERS`   -  ممبر های عادی
`PREMIUM`   -  اکانت های پریمیوم

⭕️  مثال : RECENTLY MEMBERS PREMIUM

اگر هم فیلتری ندارید عبارت `none` را ارسال کنید 
'''

Activity_Report_Change='''⭕️ کاربر گرامی :
آیا میخواهید اکانت های ریپورت را ( غیر فعال 🔴) و اکانت های ازاد را ( فعال 🟢) نمایید ؟

اگر این مایل به انجام این فرایند هستید واژه ` بله ` را ارسال کنید و در غیر این صورت ` خیر ` را ارسال کنید : 
'''

Find_Nums=lambda num , name , username , id   : f'''🕵️‍♂️ اطلاعات شماره {num} بر حسب زیر است 🕵️‍♂️ 

💡 𝘯𝘢𝘮𝘦 : {name}
💡 𝘶𝘴𝘦𝘳𝘯𝘢𝘮𝘦 : ` {username} `
💡 𝘪𝘥 : ` {id} `
'''

Only_Limited_Numbers='📛📛 کاربر گرامی : \n شما فقط میتوانید 10 شماره را در یک بار جستوجو کنید 📛📛'

Echo_Airdrop='''⭕️ کاربر گرامی :

* پیامی که میخواهید به ربات فرستاده بشود را ارسال کنید  *
همچنین شما میتوانید از واژه های :

` JOIN ` : جوین شدن توی کانال از متن و دکمه ها به صورت اتوماتیک 

` CAPTCHA ` : فرستادن کپچا برای شما و دریافت جواب و تکمیل کپچا با آن اکانت 

` RESPOND ` : فرستادن پیام ربات برای شما و دریافت جواب اختصاصی که از طریق همان اکانت ارسال میشود 

` CLICK ` : کلیک بر روی دکمه مورد نظر 

` HYBRID ` : ترکیب قابلیت ها >> مثال >> اول کلیک  و بعد جوین شدن  

` CANCEL ` : اتمام یا لغو عملیات 
'''

Echo_Test='''⭕️ کاربر گرامی :
متنی که میخواهید به ربات ارسال بشود را ارسال کنید 
'''

dev_attack_fin = lambda users , num , x : f'''
{users}

تعداد {x} بنر ارسال شد ! 

اکانت : {num}'''


Link_Invalied='📛 لینک نامعتبر است 📛'
Requested_Chat='📛 چت به صورت ریکوستی هست  📛'
History_Closed='📛 هیستوری گروه بسته است 📛'


Acc_banned=lambda num : f''' 📛 اکانت {num} از گروه بن شده است یا لینک گروه خراب است 📛'''

message_C = 'تعداد پیام هایی که هر کاربر دادند : \n'

Connecting_e=lambda num : f''' 📛 اکانت {num} نمیتواند با سرور تلگرام ارتباط برقرار کند , ربات تلاش خود را دوباره میکند !📛'''

All_Accounts_Turned='✅ فعالیت تمامی اکانت ها عوض شدند ✅ '

Natural_Acc='''اکانتِ طبیعی 🧪 :  این قابلیت برای کمتر شدن دیلیتی هست با روشن کردن این قابلیت اکانت های شما به صورت زندوم در طول روز انلاین میشن و باهم گفتگو میکنند و در کانال ها و گروه ها فعالیت میکنند و از ربات دارک و سایر ربات ها استفاده میکنند و با فعالیت در کانال ها  نرخ دیلیتی رو پایین میارن😄'''

Num_Natural_Deleted=lambda Num: f'💢📛 : اکانت ی {Num} از سرور تلگرام دیلت شده است !  💢'


askforward_banner='''⭕️ کاربر گرامی :
بنری که میخواهید فروارد شود را فروارد یا ارسال کنید 
'''

Limit_Catchers = 'سقف گرفتن ممبر از روش پیام ها 100 یوزر است 📛 !'